Revit 2027 API
BuiltInFailures.RebarShapeFailures.MultipleArcsMustOverlap Property
 Multiple arcs are supported only if they are concentric and form a circle with an overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultipleArcsMustOverlap { get; }
Public Shared ReadOnly Property MultipleArcsMustOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultipleArcsMustOverlap {
	FailureDefinitionId^ get ();
}
static member MultipleArcsMustOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace